[
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27007",
        "regulations": "If any provision of this chapter, or application thereof, to any person or circumstance is held invalid, that invalidity shall not affect other provisions or applications of this chapter that can be given effect without the invalid provision or application, and to this end the provisions of this chapter are declared to be severable."
    },
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27006",
        "regulations": "(a) This chapter may only be enforced in a civil action brought in the name of the people of the State of California by the Attorney General.\n(b) The Attorney General shall adopt regulations to further the purposes of this chapter, including regulations regarding age assurance and parental consent by January 1, 2027. The Attorney General may adopt regulations that provide for exceptions to this chapter, but only if those exceptions further the purpose of protecting minors.\n(c) In promulgating the regulations described in subdivision (b), the Attorney General shall solicit public comment regarding the impact that any regulation might have based on the nondiscrimination characteristics set forth in Section 51 of the Civil Code or in any other applicable law."
    },
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27005",
        "regulations": "An operator of an addictive internet-based service or application shall publicly disclose, on an annual basis, the number of minor users of its addictive internet-based service or application, and of that total the number for whom the operator has received verifiable parental consent to provide an addictive feed, and the number of minor users as to whom the controls set forth in Section 27002 are or are not enabled."
    },
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27004",
        "regulations": "(a) An operator may choose not to provide services to minors. However, the operator of an addictive internet-based service or application shall not withhold, degrade, lower the quality of, or increase the price of, any product, service, or feature, other than as required by this chapter, due to a user or parent availing themselves of the rights provided by this chapter, or due to the protections required by this chapter.\n(b) A parent’s provision of consent as described in Section 27001 or 27002, or the use by a parent of a mechanism as described in Section 27002, does not waive, release, otherwise limit, or serve as a defense to, any claim that the parent, or that the user who is a minor or was a minor at the time of using the internet-based service or application, might have against the operator of an addictive internet-based service or application regarding any harm to the mental health or well-being of the user.\n(c) The protections provided by this chapter are in addition to those provided by any other applicable law, including, but not limited to, the California Age-Appropriate Design Code Act (Title 1.81.47 (commencing with Section 1798.99.28) of Part 4 of Division 3 of the Civil Code)."
    },
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27003",
        "regulations": "(a) This chapter shall not be construed as requiring the operator of an addictive internet-based service or application to give a parent any additional or special access to, or control over, the data or accounts of their child.\n(b) This chapter shall not be construed as preventing any action taken in good faith to restrict access to, or availability of, media."
    },
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27002",
        "regulations": "(a) (1) Except as provided in paragraph (2), it shall be unlawful for the operator of an addictive internet- based service or application, between the hours of 12 a.m. and 6 a.m., in the user’s local time zone, and between the hours of 8 a.m. and 3 p.m., from Monday through Friday from September through May in the user’s local time zone, to send notifications to a user if the operator has actual knowledge that the user is a minor unless the operator has obtained verifiable parental consent to send those notifications.\n(2) Commencing January 1, 2027, it shall be unlawful for the operator of an addictive internet-based service or application, between the hours of 12 a.m. and 6 a.m., in the user’s local time zone, and between the hours of 8 a.m. and 3 p.m., from Monday through Friday from September through May in the user’s local time zone, to send notifications to a user whom the operator has not reasonably determined is not a minor, including pursuant to regulations promulgated by the Attorney General, unless the operator has obtained verifiable parental consent to send those notifications.\n(b) The operator of an addictive internet-based service or application shall provide a mechanism through which the verified parent of a user who is a minor may do any of the following:\n(1) Prevent their child from accessing or receiving notifications from the addictive internet-based service or application between specific hours chosen by the parent. This setting shall be set by the operator as on by default, in a manner in which the child’s access is limited between the hours of 12 a.m. and 6 a.m., in the user’s local time zone.\n(2) Limit their child’s access to any addictive feed from the addictive internet-based service or application to a length of time per day specified by the verified parent. This setting shall be set by the operator as on by\ndefault, in a manner in which the child’s access is limited to one hour per day unless modified by the verified parent.\n(3) Limit their child’s ability to view the number of likes or other forms of feedback to pieces of media within an addictive feed. This setting shall be set by the operator as on by default.\n(4) Require that the default feed provided to the child when entering the internet-based service or application be one in which pieces of media are not recommended, selected, or prioritized for display based on information provided by the user, or otherwise associated with the user or the user’s device, other than the user’s age or status as a minor.\n(5) Set their child’s account to private mode, in a manner in which only users to whom the child is connected on the addictive internet-based service or application may view or respond to content posted by the child. This setting shall be set by the operator as on by default."
    },
    {
        "region": "california",
        "statute": "SB 976",
        "law_id": "Section 27001",
        "regulations": "(a) It shall be unlawful for the operator of an addictive internet-based service or application to provide an addictive feed to a user unless either of the following is met:\n(1) (A) Except as provided in subparagraph (B), the operator does not have actual knowledge that the user is a minor.\n(B) Commencing January 1, 2027, the operator has reasonably determined that the user is not a minor, including pursuant to regulations promulgated by the Attorney General.\n(2) The operator has obtained verifiable parental consent to provide an addictive feed to the user who is a minor.\n(b) Information collected for the purpose of determining a user’s age or verifying parental consent pursuant to this chapter shall not be used for any purpose other than compliance with this chapter or with another applicable law. The information collected shall be deleted immediately after it is used to determine a user’s age or to verify parental consent, except as necessary to comply with state or federal law."
    },
    {
        "region": "florida",
        "statute": "CS/CS/HB 3",
        "law_id": "Section 501.1738",
        "regulations": "Anonymous age verification.—\n(1)  As used in this section, the term \"anonymous age verification\" means a commercially reasonable method used by a government agency or a business for the purpose of age verification which is conducted by a nongovernmental, independent third party organized under the laws of a state of the United States which:\n(a)  Has its principal place of business in a state of the United States; and\n(b)  Is not owned or controlled by a company formed in a foreign country, a government of a foreign country, or any other entity formed in a foreign country.\n(2)  A third party conducting anonymous age verification pursuant to this section:\n(a)  May not retain personal identifying information used to verify age once the age of an account holder or a person seeking an account has been verified.\n(b)  May not use personal identifying information used to verify age for any other purpose.\n(c)  Must keep anonymous any personal identifying information used to verify age. Such information may not be shared or otherwise communicated to any person.\n(d)  Must protect personal identifying information used to verify age from unauthorized or illegal access, destruction, use, modification, or disclosure through reasonable security procedures and practices appropriate to the nature of the personal information."
    },
    {
        "region": "florida",
        "statute": "CS/CS/HB 3",
        "law_id": "Section 501.1737",
        "regulations": "Age verification for online access to materials harmful to minors.—\n(1)  As used in this section, the term:\n(a)  \"Anonymous age verification\" has the same meaning as in s. 501.1738.\n(b)  \"Commercial entity\" includes a corporation, a limited liability company, a partnership, a limited partnership, a sole proprietorship, and any other legally recognized entity.\n(c)  \"Department\" means the Department of Legal Affairs.\n(d)  \"Distribute\" means to issue, sell, give, provide, deliver, transfer, transmit, circulate, or disseminate by any means.\n(e)  \"Material harmful to minors\" means any material that:\n1.  The average person applying contemporary community standards would find, taken as a whole, appeals to the prurient interest;\n2.  Depicts or describes, in a patently offensive way, sexual conduct as specifically defined in s. 847.001(19); and\n3.  When taken as a whole, lacks serious literary, artistic, political, or scientific value for minors.\n(f)  \"News-gathering organization\" means any of the following:\n1.  A newspaper, news publication, or news source, printed or published online or on a mobile platform, engaged in reporting current news and matters of public interest, and an employee thereof who can provide documentation of such employment.\n2.  A radio broadcast station, television broadcast station, cable television operator, or wire service, and an employee thereof who can provide documentation of such employment.\n(g)  \"Publish\" means to communicate or make information available to another person or entity on a publicly available website or application.\n(h)  \"Resident\" means a person who lives in this state for more than 6 months of the year.\n(i)  \"Standard age verification\" means any commercially reasonable method of age verification approved by the commercial entity.\n(j)  \"Substantial portion\" means more than 33.3 percent of total material on a website or application.\n(2)  A commercial entity that knowingly and intentionally publishes or distributes material harmful to minors on a website or application, if the website or application contains a substantial portion of material harmful to minors, must use either anonymous age verification or standard age verification to verify that the age of a person attempting to access the material is 18 years of age or older and prevent access to the material by a person younger than 18 years of age. The commercial entity must offer anonymous age verification and standard age verification, and a person attempting to access the material may select which method will be used to verify his or her age.\n(3)  A commercial entity must ensure that the requirements of s. 501.1738 are met.\n(4)(a)  This section does not apply to any bona fide news or public interest broadcast, website video, report, or event and does not affect the rights of a news-gathering organization.\n(b)  An Internet service provider or its affiliates or subsidiaries, a search engine, or a cloud service provider does not violate this section solely for providing access or connection to or from a website or other information or content on the Internet or a facility, system, or network not under the provider's control, including transmission, downloading, intermediate storage, or access software, to the extent the provider is not responsible for the creation of the content of the communication which constitutes material harmful to minors.\n(5)(a)  Any violation of subsection (2) or subsection (3) is deemed an unfair and deceptive trade practice actionable under part II of this chapter solely by the department on behalf of a resident minor against a commercial entity. If the department has reason to believe that a commercial entity is in violation of subsection (2) or subsection (3), the department, as the enforcing authority, may bring an action against the commercial entity for an unfair or deceptive act or practice. For the purpose of bringing an action pursuant to this section, ss. 501.211 and 501.212 do not apply. In addition to any other remedy under part II of this chapter, the department may collect a civil penalty of up to $50,000 per violation and reasonable attorney fees and court costs. When the commercial entity's failure to comply with subsection (2) or subsection (3) is a consistent pattern of conduct of the commercial entity, punitive damages may be assessed against the commercial entity.\n(b)  A third party that performs age verification for a commercial entity in violation of s. 501.1738 is deemed to have committed an unfair and deceptive trade practice actionable under part II of this chapter solely by the department against such third party. If the department has reason to believe that the third party is in violation of s. 501.1738, the department, as the enforcing authority, may bring an action against such third party for an unfair or deceptive act or practice. For the purpose of bringing an action pursuant to this section, ss. 501.211 and 501.212 do not apply. In addition to other remedies under part II of this chapter, the department may collect a civil penalty of up to $50,000 per violation and reasonable attorney fees and court costs.\n(c)  A commercial entity that violates subsection (2) for failing to prohibit access or prohibit a minor from future access to material harmful to minors after a report of unauthorized or unlawful access is liable to the minor for such access, including court costs and reasonable attorney fees as ordered by the court. Claimants may be awarded up to $10,000 in damages. A civil action for a claim under this paragraph must be brought within 1 year from the date the complainant knew, or reasonably should have known, of the alleged violation.\n(d)  Any action under this subsection may only be brought on behalf of or by a resident minor.\n(6)  For purposes of bringing an action under subsection (5), a commercial entity that publishes or distributes material harmful to minors on a website or application, if the website or application contains a substantial portion of material harmful to minors and such website or application is available to be accessed in this state, is considered to be both engaged in substantial and not isolated activities within this state and operating, conducting, engaging in, or carrying on a business and doing business in this state, and is therefore subject to the jurisdiction of the courts of this state.\n(7)  This section does not preclude any other available remedy at law or equity.\n(8)(a)  If, by its own inquiry or as a result of complaints, the department has reason to believe that an entity or person has engaged in, or is engaging in, an act or practice that violates this section, the department may administer oaths and affirmations, subpoena witnesses or matter, and collect evidence. Within 5 days, excluding weekends and legal holidays, after the service of a subpoena or at any time before the return date specified therein, whichever is longer, the party served may file in the circuit court in the county in which it resides or in which it transacts business and serve upon the enforcing authority a petition for an order modifying or setting aside the subpoena. The petitioner may raise any objection or privilege which would be available upon service of such subpoena in a civil action. The subpoena shall inform the party served of its rights under this subsection.\n(b)  If the matter that the department seeks to obtain by subpoena is located outside the state, the entity or person subpoenaed may make it available to the department or its representative to examine the matter at the place where it is located. The department may designate representatives, including officials of the state in which the matter is located, to inspect the matter on its behalf, and may respond to similar requests from officials of other states.\n(c)  Upon failure of an entity or person without lawful excuse to obey a subpoena and upon reasonable notice to all persons affected, the department may apply to the circuit court for an order compelling compliance.\n(d)  The department may request that an entity or person that refuses to comply with a subpoena on the ground that testimony or matter may incriminate the entity or person be ordered by the court to provide the testimony or matter. Except in a prosecution for perjury, an entity or individual that complies with a court order to provide testimony or matter after asserting a valid privilege against self-incrimination shall not have the testimony or matter so provided, or evidence derived therefrom, received against the entity or person in any criminal investigation or proceeding.\n(e)  Any entity or person upon whom a subpoena is served pursuant to this section shall comply with the terms thereof unless otherwise provided by order of the court. Any entity or person that fails to appear with the intent to avoid, evade, or prevent compliance in whole or in part with any investigation under this part or that removes from any place, conceals, withholds, mutilates, alters, or destroys, or by any other means falsifies any documentary material in the possession, custody, or control of any entity or person subject to any such subpoena, or knowingly conceals any relevant information with the intent to avoid, evade, or prevent compliance, shall be liable for a civil penalty of not more than $5,000 per week in violation, reasonable attorney's fees, and costs.\n(9)  The department may adopt rules to implement this section."
    },
    {
        "region": "florida",
        "statute": "CS/CS/HB 3",
        "law_id": "Section 501.1736",
        "regulations": "Social media use for minors.—\n(1)  As used in this section, the term:\n(a)  \"Account holder\" means a resident who opens an account or creates a profile or is identified by the social media platform by a unique identifier while using or accessing a social media platform when the social media platform knows or has reason to believe the resident is located in this state.\n(b)  \"Daily active users\" means the number of unique users in the United States who used the online forum, website, or application at least 80 percent of the days during the previous 12 months, or, if the online forum, website, or application did not exist during the previous 12 months, the number of unique users in the United States who used the online forum, website, or application at least 80 percent of the days during the previous month.\n(c)  \"Department\" means the Department of Legal Affairs.\n(d)  \"Resident\" means a person who lives in this state for more than 6 months of the year.\n(e)  \"Social media platform\" means an online forum, website, or application that satisfies each of the following criteria:\n1.  Allows users to upload content or view the content or activity of other users;\n2.  Ten percent or more of the daily active users who are younger than 16 years of age spend on average 2 hours per day or longer on the online forum, website, or application on the days when using the online forum, website, or application during the previous 12 months or, if the online forum, website, or application did not exist during the previous 12 months, during the previous month;\n3.  Employs algorithms that analyze user data or information on users to select content for users; and\n4.  Has any of the following addictive features:\na.  Infinite scrolling, which means either:\n(I)  Continuously loading content, or content that loads as the user scrolls down the page without the need to open a separate page; or\n(II)  Seamless content, or the use of pages with no visible or apparent end or page breaks.\nb.  Push notifications or alerts sent by the online forum, website, or application to inform a user about specific activities or events related to the user's account.\nc.  Displays personal interactive metrics that indicate the number of times other users have clicked a button to indicate their reaction to content or have shared or reposted the content.\nd.  Auto-play video or video that begins to play without the user first clicking on the video or on a play button for that video.\ne.  Live-streaming or a function that allows a user or advertiser to broadcast live video content in real-time.\n\nThe term does not include an online service, website, or application where the exclusive function is e-mail or direct messaging consisting of text, photographs, pictures, images, or videos shared only between the sender and the recipients, without displaying or posting publicly or to other users not specifically identified as the recipients by the sender.\n(2)(a)  A social media platform shall prohibit a minor who is younger than 14 years of age from entering into a contract with a social media platform to become an account holder.\n(b)  A social media platform shall:\n1.  Terminate any account held by an account holder younger than 14 years of age, including accounts that the social media platform treats or categorizes as belonging to an account holder who is likely younger than 14 years of age for purposes of targeting content or advertising, and provide 90 days for an account holder to dispute such termination. Termination must be effective upon the expiration of the 90 days if the account holder fails to effectively dispute the termination.\n2.  Allow an account holder younger than 14 years of age to request to terminate the account. Termination must be effective within 5 business days after such request.\n3.  Allow the confirmed parent or guardian of an account holder younger than 14 years of age to request that the minor's account be terminated. Termination must be effective within 10 business days after such request.\n4.  Permanently delete all personal information held by the social media platform relating to the terminated account, unless there are legal requirements to maintain such information.\n(3)(a)  A social media platform shall prohibit a minor who is 14 or 15 years of age from entering into a contract with a social media platform to become an account holder, unless the minor's parent or guardian provides consent for the minor to become an account holder.\n(b)  A social media platform shall:\n1.  Terminate any account held by an account holder who is 14 or 15 years of age, including accounts that the social media platform treats or categorizes as belonging to an account holder who is likely 14 or 15 years of age for purposes of targeting content or advertising, if the account holder's parent or guardian has not provided consent for the minor to create or maintain the account. The social media platform shall provide 90 days for an account holder to dispute such termination. Termination must be effective upon the expiration of the 90 days if the account holder fails to effectively dispute the termination.\n2.  Allow an account holder who is 14 or 15 years of age to request to terminate the account. Termination must be effective within 5 business days after such request.\n3.  Allow the confirmed parent or guardian of an account holder who is 14 or 15 years of age to request that the minor's account be terminated. Termination must be effective within 10 business days after such request.\n4.  Permanently delete all personal information held by the social media platform relating to the terminated account, unless there are legal requirements to maintain such information.\n(4)  If a court enjoins the enforcement of subsection (3) or would otherwise enjoin enforcement of any other provision of this section due to subsection (3), then subsection (3) shall be severed, and the following shall come into effect:\n(a)  A social media platform shall prohibit a minor who is 14 or 15 years of age from entering into a contract with a social media platform to become an account holder.\n(b)  A social media platform shall:\n1.  Terminate any account held by an account holder who is 14 or 15 years of age, including accounts that the social media platform treats or categorizes as belonging to an account holder who is likely 14 or 15 years of age for purposes of targeting content or advertising, and provide 90 days for an account holder to dispute such termination. Termination must be effective upon the expiration of 90 days if the account holder fails to effectively dispute the termination.\n2.  Allow an account holder who is 14 or 15 years of age to request to terminate the account. Termination must be effective within 5 business days after such request.\n3.  Allow the confirmed parent or guardian of an account holder who is 14 or 15 years of age to request that the minor's account be terminated. Termination must be effective within 10 business days after such request.\n4.  Permanently delete all personal information held by the social media platform relating to the terminated account, unless there are legal requirements to maintain such information.\n(5)  Any knowing or reckless violation of subsection (2), subsection (3), or, if in effect, subsection (4) is deemed an unfair and deceptive trade practice actionable under part II of this chapter solely by the department against a social media platform. If the department has reason to believe that a social media platform is in violation of subsection (2), subsection (3), or, if in effect, subsection (4), the department, as the enforcing authority, may bring an action against such platform for an unfair or deceptive act or practice. For the purpose of bringing an action pursuant to this section, ss. 501.211 and 501.212 do not apply. In addition to other remedies under part II of this chapter, the department may collect a civil penalty of up to $50,000 per violation and reasonable attorney fees and court costs. When the social media platform's failure to comply with subsection (2), subsection (3), or, if in effect, subsection (4) is a consistent pattern of knowing or reckless conduct, punitive damages may be assessed against the social media platform.\n(6)(a)  A social media platform that knowingly or recklessly violates subsection (2), subsection (3), or, if in effect, subsection (4) is liable to the minor account holder, including court costs and reasonable attorney fees as ordered by the court. Claimants may be awarded up to $10,000 in damages.\n(b)  A civil action for a claim under this subsection must be brought within 1 year from the date the complainant knew, or reasonably should have known, of the alleged violation.\n(c)  Any action brought under this subsection may only be brought on behalf of a minor account holder.\n(7)  For purposes of bringing an action under this section, a social media platform that allows a minor account holder younger than 14 years of age or a minor account holder who is 14 or 15 years of age to create an account on such platform is considered to be both engaged in substantial and not isolated activities within this state and operating, conducting, engaging in, or carrying on a business and doing business in this state, and is therefore subject to the jurisdiction of the courts of this state.\n(8)  If a social media platform allows an account holder to use the social media platform, the parties have entered into a contract.\n(9)  This section does not preclude any other available remedy at law or equity.\n(10)(a)  If, by its own inquiry or as a result of complaints, the department has reason to believe that an entity or person has engaged in, or is engaging in, an act or practice that violates this section, the department may administer oaths and affirmations, subpoena witnesses or matter, and collect evidence. Within 5 days, excluding weekends and legal holidays, after the service of a subpoena or at any time before the return date specified therein, whichever is longer, the party served may file in the circuit court in the county in which it resides or in which it transacts business and serve upon the enforcing authority a petition for an order modifying or setting aside the subpoena. The petitioner may raise any objection or privilege which would be available upon service of such subpoena in a civil action. The subpoena shall inform the party served of its rights under this subsection.\n(b)  If the matter that the department seeks to obtain by subpoena is located outside the state, the entity or person subpoenaed may make it available to the department or its representative to examine the matter at the place where it is located. The department may designate representatives, including officials of the state in which the matter is located, to inspect the matter on its behalf, and may respond to similar requests from officials of other states.\n(c)  Upon failure of an entity or person without lawful excuse to obey a subpoena and upon reasonable notice to all persons affected, the department may apply to the circuit court for an order compelling compliance.\n(d)  The department may request that an entity or person that refuses to comply with a subpoena on the ground that testimony or matter may incriminate the entity or person be ordered by the court to provide the testimony or matter. Except in a prosecution for perjury, an entity or individual that complies with a court order to provide testimony or matter after asserting a valid privilege against self-incrimination shall not have the testimony or matter so provided, or evidence derived therefrom, received against the entity or person in any criminal investigation or proceeding.\n(e)  Any entity or person upon whom a subpoena is served pursuant to this section shall comply with the terms thereof unless otherwise provided by order of the court. Any entity or person that fails to appear with the intent to avoid, evade, or prevent compliance in whole or in part with any investigation under this part or who removes from any place, conceals, withholds, mutilates, alters, or destroys, or by any other means falsifies any documentary material in the possession, custody, or control of any entity or person subject to any such subpoena, or knowingly conceals any relevant information with the intent to avoid, evade, or prevent compliance shall be liable for a civil penalty of not more than $5,000 per week in violation, reasonable attorney's fees, and costs.\n(11)  The department may adopt rules to implement this section."
    },
    {
        "region": "utah",
        "statute": "HB 0311",
        "law_id": "Section 13-2-1",
        "regulations": "Section 8.   Effective date.(1)  Except as provided in Subsection (2), this bill takes effect on May 3, 2023.(2)  The actions affecting Section  13-2-1  (Effective 12/31/2023) take effect onDecember 31, 2023."
    },
    {
        "region": "utah",
        "statute": "HB 0311",
        "law_id": "Section 13-63-501",
        "regulations": "Section 7.  Section  13-63-501  is enacted to read:Part 5. Severability13-63-501.    Severability.If any provision of this chapter or the application of any provision to any person orcircumstance is held invalid by a final decision of a court of competent jurisdiction, theremainder of this chapter shall be given effect without the invalid provision or application. Theprovisions of this chapter are severable."
    },
    {
        "region": "utah",
        "statute": "HB 0311",
        "law_id": "Section 13-63-401",
        "regulations": "Section 6.  Section  13-63-401  is enacted to read:Part 4. Waiver Prohibited13-63-401.    Waiver prohibited.A waiver or limitation, or a purported waiver or limitation, of any of the following isvoid as unlawful, is against public policy, and a court or arbitrator may not enforce or giveeffect to the waiver, notwithstanding any contract or choice-of-law provision in a contract:(1)  a protection or requirement provided under this chapter;(2)  the right to cooperate with the division or to file a complaint with the division;(3)  the right to a private right of action as provided under this chapter; or(4)  the right to recover actual damages, statutory damages, civil penalties, costs, or feesas allowed by this chapter."
    },
    {
        "region": "utah",
        "statute": "HB 0311",
        "law_id": "Section 13-63-301",
        "regulations": "Section 5.  Section  13-63-301  is enacted to read:Part 3. Harm to a Minor by a Social Media Company -- Private Right of Action13-63-301.    Private right of action for harm to a minor -- Rebuttable presumptionof harm and causation.(1)  Beginning March 1, 2024, a person may bring an action under this section against asocial media company to recover damages incurred after March 1, 2024 by a Utah minoraccount holder for any addiction, financial, physical, or emotional harm suffered as aconsequence of using or having an account on the social media company's social mediaplatform.(2)  A suit filed under the authority of this section shall be filed in the district court forthe district in which the Utah minor account holder resides.(3)  Notwithstanding Subsection (4), if a court finds that a Utah minor account holderhas been harmed as a consequence of using or having an account on the social mediaccompany's social media platform, the minor seeking relief under this section is entitled to:(a)  an award of reasonable attorney fees and court costs; and(b)  an amount equal to the greater of:(i)  $2,500 per each incident of harm; or(ii)  actual damages for addiction, financial, physical, and emotional harm incurred bythe person bringing the action, if the court determines that the harm is a direct consequence ofthe violation or violations.(4)  If a Utah minor account holder seeking recovery of damages under this section isunder the age of 16, there shall be a rebuttable presumption that the harm actually occurredand that the harm was a caused as a consequence of using or having an account on the socialmedia company's social media platform."
    },
    {
        "region": "utah",
        "statute": "HB 0311",
        "law_id": "Section 13-63-201",
        "regulations": "Section 4.  Section  13-63-201  is enacted to read:Part 2. Social Media Design Regulations13-63-201.    Social media platform design regulations -- Enforcement and auditingauthority -- Penalties.(1)  Beginning March 1, 2024:(a)  the division shall administer and enforce the provisions of this section; and(b)  the division may audit the records of a social media company in order to determinecompliance with the requirements of this section or to investigate a complaint, including arandom sample of a social media company's records and other audit methods.(2)  Beginning March 1, 2024, a social media company shall not use a practice, design,or feature on the company's social media platform that the social media company knows, orwhich by the exercise of reasonable care should know, causes a Utah minor account holder tohave an addiction to the social media platform.(3)  Beginning March 1, 2024:(a)  Subject to Subsection (3)(b), a social media company is subject to:(i)  a civil penalty of $250,000 for each practice, design, or feature shown to havecaused addiction; and(ii)  a civil penalty of up to $2,500 for each Utah minor account holder who is shown tohave been exposed to the practice, design, or feature found to have caused addiction underSubsection (3)(a)(i).(b)  A social media company shall not be subject to a civil penalty for violating thissection if the social media company, as an affirmative defense, demonstrates that the socialmedia company:(i)  instituted and maintained a program of at least quarterly audits of the social mediacompany's practices, designs, and features to detect practices, designs, or features that havethe potential to cause or contribute to the addiction of a minor user; and(ii)  corrected, within 30 days of the completion of an audit described in Subsection(3)(b)(i), any practice, design, or feature discovered by the audit to present more than ade minimus risk of violating this section.(c)  In a court action by the division to enforce this section, the court may, in addition toa civil penalty:(i)  declare that the act or practice violates a provision of this section;(ii)  issue an injunction for a violation of this section;(iii)  award actual damages to an injured purchaser or consumer; and(iv)  award any other relief that the court deems reasonable and necessary.(4)  Nothing in this section may be construed to impose liability for a social mediacompany for any of the following:(a)  content that is generated by an account holder, or uploaded to or shared on theplatform by an account holder, that may be encountered by another account holder;(b)  passively displaying content that is created entirely by a third party;(c)  information or content for which the social media company was not, in whole or inpart, responsible for creating or developing; or(d)  any conduct by a social media company involving a Utah minor account holderwho would otherwise be protected by federal or Utah law.(5)  If a court of competent jurisdiction grants judgment or injunctive relief to thedivision, the court shall award the division:(a)  reasonable attorney fees;(b)  court costs; and(c)  investigative fees.(6)  Nothing in this section may be construed to negate or limit a cause of action thatmay have existed or exists against a social media company under the law as it existed beforethe effective date of this section.(7)  All money received for the payment of a fine or civil penalty imposed under thissection shall be deposited into the Consumer Protection Education and Training Fundestablished in Section  13-2-8 ."
    },
    {
        "region": "utah",
        "statute": "HB 0311",
        "law_id": "Section 13-63-101",
        "regulations": "Section 3.  Section  13-63-101  is enacted to read:CHAPTER 63. UTAH SOCIAL MEDIA REGULATION ACTPart 1. General Requirements13-63-101.    Definitions.As used in this chapter:(1)  \"Account holder\" means a person who has, or opens, an account or profile to use a social media company's platform.(2)  \"Addiction\" means use of a social media platform that:(a)  indicates the user's substantial preoccupation or obsession with, or the user's substantial difficulty to cease or reduce use of, the social media platform; and(b)  causes physical, mental, emotional, developmental, or material harms to the user.(3)  \"Director\" means the director of the Division of Consumer Protection created inSection  13-2-1 .(4)  \"Division\" means the Division of Consumer Protection created in Section  13-2-1 .(5)  \"Educational entity\" means a public school, an LEA, a charter school, the UtahSchools for the Deaf and Blind, a private school, a denominational school, a parochial school, a community college, a state college, a state university, or a nonprofit private postsecondaryeducational institution.(6) (a)  \"Interactive computer service\" means an information service, information system, or information access software provider that:(i)  provides or enables computer access by multiple users to a computer server; and(ii)  provides access to the Internet.(b)  \"Interactive computer service\" includes:(i)  a web service;(ii)  a web system;(iii)  a website;(iv)  a web application; or(v)  a web portal.(7)  \"Minor\" means an individual who is under the age of 18 and:(a)  has not been emancipated as that term is defined in Section  80-7-102 ; or(b)  has not been married.(8)  \"Post\" means content that an account holder makes available on a social mediaplatform for other account holders or users to view.(9)  \"Social media company\" means a person or entity that:(a)  provides a social media platform that has at least 5,000,000 account holdersworldwide; and(b)  is an interactive computer service.(10) (a)  \"Social media platform\" means an online forum that a social media companymakes available for an account holder to:(i)  create a profile;(ii)  upload posts;(iii)  view the posts of other account holders; and(iv)  interact with other account holders or users.(b)  \"Social media platform\" does not include an online service, website, or application:(i)  where the predominant or exclusive function is:(A)  electronic mail;(B)  direct messaging consisting of text, photos, or videos that are sent between devicesby electronic means, where messages are:(I)  shared between the sender and the recipient;(II)  only visible to the sender and the recipient; and(III)  are not posted publicly;(C)  a streaming service that:(I)  provides only licensed media in a continuous flow from the service, website, orapplication to the end user; and(II)  does not obtain a license to the media from a user or account holder by agreementto its terms of service;(D)  news, sports, entertainment, or other content that is preselected by the provider andnot user generated, and any chat, comment, or interactive functionality that is providedincidental to, directly related to, or dependent upon provision of the content;(E)  online shopping or e-commerce, if the interaction with other users or accountholders is generally limited to:(I)  the ability to upload a post and comment on reviews;(II)  the ability to display lists or collections of goods for sale or wish lists; and(III)  other functions that are focused on online shopping or e-commerce rather thaninteraction between users or account holders;(F)  interactive gaming, virtual gaming, or an online service, that allows the creationand uploading of content for the purpose of interactive gaming, edutainment, or associatedentertainment, and the communication related to that content;(G)  photo editing that has an associated photo hosting service, if the interaction withother users or account holders is generally limited to liking or commenting;(H)  a professional creative network for showcasing and discovering artistic content, if thecontent is required to be non-pornographic;(I)  single-purpose community groups for public safety if:(I)  the interaction with other users or account holders is generally limited to that singlepurpose; and(II)  the community group has guidelines or policies against illegal content;(J)  providing career development opportunities, including professional networking, jobskills, learning certifications, and job posting and application services;(K)  business to business software;(L)  a teleconferencing or videoconferencing service that allows reception andtransmission of audio and video signals for real time communication;(M)  cloud storage;(N)  shared document collaboration;(O)  cloud computing services, which may include cloud storage and shared documentcollaboration;(P)  providing access to or interacting with data visualization platforms, libraries, orhubs;(Q)  to permit comments on a digital news website, if the news content is posted onlyby the provider of the digital news website;(R)  providing or obtaining technical support for a platform, product, or service;(S)  academic or scholarly research; or(T)  genealogical research; or(ii)  where:(A)  the majority of the content that is posted or created is posted or created by theprovider of the online service, website, or application; and(B)  the ability to chat, comment, or interact with other users is directly related to theprovider's content;(iii)  that is a classified ad service that only permits the sale of goods and prohibits thesolicitation of personal services; or(iv)  that is used by and under the direction of an educational entity, including:(A)  a learning management system;(B)  a student engagement program; and(C)  a subject or skill-specific program.(11)  \"User\" means a person who has access to view all, or some of, the posts on a socialmedia platform, but is not an account holder.(12) (a)  \"Utah account holder\" means a person who is a Utah resident and an accountholder.(b)  \"Utah account holder\" includes a Utah minor account holder.(13)  \"Utah minor account holder\" means a Utah account holder who is a minor.(14)  \"Utah resident\" means an individual who currently resides in Utah."
    },
    {
        "region": "utah",
        "statute": "SB 0152",
        "law_id": "Section 13-63-203",
        "regulations": "Section 10.  Section  13-63-203  is enacted to read:13-63-203.    Division report.(1)  The division shall compile an annual report:(a)  evaluating the liability and enforcement provisions of this chapter, including:(i)  the effectiveness of the division's efforts to enforce this chapter; and(ii)  any recommendations for changes to this chapter;(b)  summarizing the consumer interactions that are protected and not protected by this chapter, including a list of alleged violations the division has received; and(c)  an accounting of:(i)  all administrative fines and civil penalties assessed during the year;(ii)  all administrative fines and civil penalties collected during the year; and(iii)  the use of funds from the Consumer Protection Education and Training Fund.(2)  The division may update or correct the report as new information becomes available.(3)  The division shall submit the report to the Business and Labor Interim Committee on or before the August meeting of each interim period."
    },
    {
        "region": "utah",
        "statute": "SB 0152",
        "law_id": "Section 13-63-202",
        "regulations": "Section 9.  Section  13-63-202  is enacted to read:13-63-202.    Enforcement powers of the division.(1)  Except for a private right of action under Section  13-63-301 , the division has the exclusive authority to administer and enforce the requirements of Part 1, General Requirements.(2)  The attorney general, upon request, shall give legal advice to, and act as counsel for, the division in the exercise of the division's responsibilities under this part.(3) (a)  Subject to the ability to cure an alleged violation under Subsection (4):(i)  the division director may impose an administrative fine of up to $2,500 for each violation of Part 1, General Requirements; and(ii)  the division may bring an action in a court of competent jurisdiction to enforce a provision of Part 1, General Requirements.(b)  In a court action by the division to enforce a provision of Part 1, General Requirements, the court may:(i)  declare that the act or practice violates a provision of Part 1, General Requirements;(ii)  issue an injunction for a violation of Part 1, General Requirements;(iii)  order disgorgement of any money received in violation of Part 1, General Requirements;(iv)  order payment of disgorged money to an injured purchaser or consumer;(v)  impose a civil penalty of up to $2,500 for each violation of Part 1, General Requirements;(vi)  award actual damages to an injured purchaser or consumer; and(vii)  award any other relief that the court deems reasonable and necessary.(4) (a)  At least 30 days before the day on which the division initiates an enforcement action against a person that is subject to the requirements of Part 1, General Requirements, the division shall provide the person with:(i)  written notice that identifies each alleged violation; and(ii)  an explanation of the basis for each allegation.(b)  Except as provided under Subsection (4)(c), the division may not initiate an action if the person:(i)  cures the noticed violation within 30 days after the day on which the person receives the notice described in Subsection (4)(a); and(ii)  provides the division with a written statement that:(A)  the person has cured the violation; and(B)  no further violation will occur.(c)  The division may initiate a civil action against a person that:(i)  fails to cure a violation after receiving the notice described in Subsection (4)(a); or(ii)  after curing a noticed violation and providing a written statement in accordance with Subsection (4)(b), commits another violation of the same provision.(5)  If a court of competent jurisdiction grants judgment or injunctive relief to the division, the court shall award the division:(a)  reasonable attorney fees;(b)  court costs; and(c)  investigative fees.(6) (a)  A person who violates an administrative or court order issued for a violation of Part 1, General Requirements, is subject to a civil penalty of no more than $5,000 for each violation.(b)  A civil penalty authorized under this section may be imposed in any civil action brought by the division, or by the attorney general on behalf of the division.(7)  All money received for the payment of a fine or civil penalty imposed under this section shall be deposited into the Consumer Protection Education and Training Fund established in Section  13-2-8 ."
    },
    {
        "region": "utah",
        "statute": "SB 0152",
        "law_id": "Section 13-63-105",
        "regulations": "Section 7.  Section  13-63-105  is enacted to read:13-63-105.    Limited hours of access for minors -- Parental access and options.(1)  Beginning March 1, 2024, a social media company shall prohibit a Utah minor account holder from having access to the Utah minor account holder's account during the hours of 10:30 p.m. to 6:30 a.m., unless the access is modified according to another requirement of this section.(2)  Time of day under this section shall be calculated based on the Internet protocol address being used by the Utah minor account holder at the time of attempting access.(3)  A social media company shall provide options for a parent or guardian with access to an account under Section  13-63-104  to:(a)  change or eliminate the time-of-day restriction described in Subsection (1); and(b)  set a limit on the number of hours per day that a Utah minor account holder may use the account.(4)  A social media company shall not permit a Utah minor account holder to change or bypass restrictions on access as required by this section.(5)  Notwithstanding any provision of this section, a social media company shall permit a parent or guardian with access to an account under Section  13-63-104  to access the account without time restrictions."
    },
    {
        "region": "utah",
        "statute": "SB 0152",
        "law_id": "Section 13-63-104",
        "regulations": "Section 6.  Section  13-63-104  is enacted to read:13-63-104.    Parental access to social media account.Beginning March 1, 2024, a social media company shall provide a parent or guardian who has given parental consent for a Utah minor account holder under Section  13-63-102  with a password or other means for the parent or guardian to access the account, which shall allow the parent or guardian to view:(1)  all posts the Utah minor account holder makes under the social media platform account; and(2)  all responses and messages sent to or by the Utah minor account holder in the social media platform account."
    },
    {
        "region": "utah",
        "statute": "SB 0152",
        "law_id": "Section 13-63-103",
        "regulations": "Section 5.  Section  13-63-103  is enacted to read:13-63-103.    Prohibition on data collection for certain accounts -- Prohibition on advertising -- Use of information -- Search results -- Directed content.Beginning March 1, 2024, a social media company, for a social media platform account held by a Utah minor account holder:(1)  shall prohibit direct messaging between the account and any other user that is not linked to the account through friending;(2)  may not show the account in search results for any user that is not linked to the account through friending;(3)  shall prohibit the display of any advertising in the account;(4)  shall not collect or use any personal information from the posts, content, messages, text, or usage activities of the account other than information that is necessary to comply with, and to verify compliance with, state or federal law, which information includes a parent or guardian's name, a birth date, and any other information required to be submitted under this section; and(5)  shall prohibit the use of targeted or suggested groups, services, products, posts, accounts, or users in the account."
    },
    {
        "region": "utah",
        "statute": "SB 0152",
        "law_id": "Section 13-63-102",
        "regulations": "Section 4.  Section  13-63-102  is enacted to read:13-63-102.    Age requirements for use of social media platform -- Parental consent -- Rulemaking authority of division.(1)  Beginning March 1, 2024, a social media company may not permit a Utah resident who is a minor to be an account holder on the social media company's social media platform unless the Utah resident has the express consent of a parent or guardian.(2)  Notwithstanding any provision of this chapter, a social media company may not permit a Utah resident who is a minor to hold or open an account on a social media platform if the minor is ineligible to hold or open an account under any other provision of state or federal law.(3) (a)  Beginning March 1, 2024, a social media company shall verify the age of an existing or new Utah account holder and, if the existing or new account holder is a minor, confirm that a minor has consent as required under Subsection (1):(i)  for a new account, at the time the Utah resident opens the account; or(ii)  for a Utah account holder who has not provided age verification as required under this section, within 14 calendar days of the Utah account holder's attempt to access the account.(b)  If a Utah account holder fails to meet the verification requirements of this section within the required time period, the social media company shall deny access to the account:(i)  upon the expiration of the time period; and(ii)  until all verification requirements are met.(4)  In accordance with Title 63G, Chapter 3, Utah Administrative Rulemaking Act, the division, with consideration of stakeholder input, shall make rules to:(a)  establish processes or means by which a social media company may meet the age verification requirements of this chapter;(b)  establish acceptable forms or methods of identification, which may not be limited to a valid identification card issued by a government entity;(c)  establish requirements for providing confirmation of the receipt of any information provided by a person seeking to verify age under this chapter;(d)  establish processes or means to confirm that a parent or guardian has provided consent for the minor to open or use an account as required under this section;(e)  establish requirements for retaining, protecting, and securely disposing of any information obtained by a social media company or its agent as a result of compliance with the requirements of this chapter;(f)  require that information obtained by a social media company or its agent in order to comply with the requirements of this chapter are only retained for the purpose of compliance and may not be used for any other purpose;(g)  if the division permits an agent to process verification requirements required by this section, require that the agent have its principal place of business in the United States of America;(h)  require other applicable state agencies to comply with any rules promulgated under the authority of this section; and(i)  ensure that the rules are consistent with state and federal law, including Title 13, Chapter 61, Utah Consumer Privacy Act."
    }
]